import SectionTitle from '../SectionTitle';

export default function AboutSection() {
    return (
        <div className="text-center">
            <SectionTitle
                text="من نحن"
                size="2xl"
                align="right"
                className="pb-6"
            />

            <div className="space-y-4 text-gray-800 leading-relaxed">
                <p className="text-lg">
                    منصة إرث المبتكرين هي منصة إلكترونية تعليمية تهدف إلى بناء مجتمع من المبتكرين والموهوبين في المؤسسات تعليمية. تعمل على ربط الطلاب المبتكرين مع المعلمين والمشرفين، وتتيح مشاركة المشاريع الإبداعية والمشاركة في التحديات والمسابقات التعليمية.
                </p>
                <p className="text-lg">
                    توفر المنصة بيئة محفزة للطلاب لعرض مشاريعهم الإبداعية، وتمكن المعلمين من متابعة وتقييم مشاريع الطلاب، وتنظيم تحديبات ومسابقات تعليمية في مجالات متنوعة (علوم، بيني، تراثي، تقني).
                </p>
                <p className="text-lg">
                    اليوم، نعمل على بناء نظام تحفيزي بالشارات والنقاط والمكافآت، وإصدار الشهادات للمؤسسات تعليمية والطلاب المتميزين، لتحفيز الإبداع والابتكار في المجتمع التعليمي.
                </p>
            </div>
        </div>
    );
}
